package ua.od.atomspace.v3;

import ua.od.atomspace.v3.конфігурація.ФабрикаЕкземплярів;
import ua.od.atomspace.v3.модель.ВідповідьМитніці;
import ua.od.atomspace.v3.модель.Людина;
import ua.od.atomspace.v3.сервіс.*;

public class МитнийДодаток {
    public static void main(String[] args) {
        ФабрикаЕкземплярів фабрикаЕкземплярів = ФабрикаЕкземплярів.Одинак.взятиЕкзкмпляр();
        // зчитати людину
        ЧергаНаКордоні чергаНаКордоні = фабрикаЕкземплярів.взятиЕкземпляр(ЧергаНаКордоніМолдови.class);
        Людина людина = чергаНаКордоні.забратиКрайнього();

        // перевірити людину
        Митниця митниця = фабрикаЕкземплярів.взятиЕкземпляр(МитницяОдеси.class);
        ВідповідьМитніці відповідьМитніці = митниця.обробитиЛюдину(людина);

        //впустити до країни, або депортувати
        МіграційнаСлужба міграційнаСлужба = фабрикаЕкземплярів.взятиЕкземпляр(МіграційнаСлужбаУкраїни.class);
        міграційнаСлужба.мігрувати(відповідьМитніці);
    }
}
