package ua.od.atomspace.v1;

public class МитнийДодаток {
    public static void main(String[] args) {
        // зчитати людину
        ЧергаНаКордоні чергаНаКордоні = new ЧергаНаКордоніМолдови();
        Людина людина = чергаНаКордоні.забратиКрайнього();

        // перевірити людину
        Митниця митниця = new МитницяОдеси();
        ВідповідьМитніці відповідьМитніці = митниця.обробитиЛюдину(людина);

        //впустити до країни, або депортувати
        МіграційнаСлужба міграційнаСлужба = new МіграційнаСлужбаУкраїни();
        міграційнаСлужба.мігрувати(відповідьМитніці);
    }
}
