package ua.od.atomspace.v2;

public class МитнийДодаток {
    public static void main(String[] args) {
        // зчитати людину
        ЧергаНаКордоні чергаНаКордоні = ЧергаНаКордоніМолдови.Одинак.взятиЕкзкмпляр();
        Людина людина = чергаНаКордоні.забратиКрайнього();

        // перевірити людину
        Митниця митниця = МитницяОдеси.Одинак.взятиЕкзкмпляр();
        ВідповідьМитніці відповідьМитніці = митниця.обробитиЛюдину(людина);

        //впустити до країни, або депортувати
        МіграційнаСлужба міграційнаСлужба = МіграційнаСлужбаУкраїни.Одинак.взятиЕкзкмпляр();
        міграційнаСлужба.мігрувати(відповідьМитніці);
    }
}
