package ua.od.atomspace.v5;

import ua.od.atomspace.v5.конфігурація.ФабрикаЕкземплярів;
import ua.od.atomspace.v5.модель.ВідповідьМитніці;
import ua.od.atomspace.v5.модель.Людина;
import ua.od.atomspace.v5.сервіс.Митниця;
import ua.od.atomspace.v5.сервіс.МіграційнаСлужба;
import ua.od.atomspace.v5.сервіс.ЧергаНаКордоні;

public class МитнийДодаток {
    public static void main(String[] args) {
        ФабрикаЕкземплярів фабрикаЕкземплярів = ФабрикаЕкземплярів.Одинак.взятиЕкзкмпляр();
        // зчитати людину
        ЧергаНаКордоні чергаНаКордоні = фабрикаЕкземплярів.взятиЕкземпляр(ЧергаНаКордоні.class);
        Людина людина = чергаНаКордоні.забратиКрайнього();

        // перевірити людину
        Митниця митниця = фабрикаЕкземплярів.взятиЕкземпляр(Митниця.class);
        ВідповідьМитніці відповідьМитніці = митниця.обробитиЛюдину(людина);

        //впустити до країни, або депортувати
        МіграційнаСлужба міграційнаСлужба = фабрикаЕкземплярів.взятиЕкземпляр(МіграційнаСлужба.class);
        міграційнаСлужба.мігрувати(відповідьМитніці);
    }
}
