package ua.od.atomspace.v6.сервіс;

import ua.od.atomspace.v6.конфігурація.анотація.Інєкція;
import ua.od.atomspace.v6.модель.ВідповідьМитніці;
import ua.od.atomspace.v6.модель.Людина;

public class МитнеМіністерствоУкраїни {

    @Інєкція
    private ЧергаНаКордоні чергаНаКордоні;
    @Інєкція
    private Митниця митниця;
    @Інєкція
    private МіграційнаСлужба міграційнаСлужба;

    public void початиЗміну() {
        // зчитати людину
        Людина людина = чергаНаКордоні.забратиКрайнього();

        // перевірити людину
        ВідповідьМитніці відповідьМитніці = митниця.обробитиЛюдину(людина);

        //впустити до країни, або депортувати
        міграційнаСлужба.мігрувати(відповідьМитніці);
    }
}
