package ua.od.atomspace.v3.сервіс;

import ua.od.atomspace.v3.модель.ВідповідьМитніці;

public class МіграційнаСлужбаУкраїни implements МіграційнаСлужба {
    @Override
    public void мігрувати(ВідповідьМитніці відповідьМитніці) {
        if (відповідьМитніці.isПідтвердженний()) {
            System.out.println(" ---> Тримайте квиток до Києва");
            return;
        }
        System.out.println(" ---> Наздогоняйте руській корабль");
    }

    private МіграційнаСлужбаУкраїни() {
    }

    public static class Одинак {
        private static МіграційнаСлужбаУкраїни міграційнаСлужбаУкраїни;

        public static МіграційнаСлужбаУкраїни взятиЕкзкмпляр() {
            if (міграційнаСлужбаУкраїни != null) {
                return міграційнаСлужбаУкраїни;
            }
            міграційнаСлужбаУкраїни = new МіграційнаСлужбаУкраїни();
            return міграційнаСлужбаУкраїни;
        }
    }
}
