package ua.od.atomspace.v4;

import ua.od.atomspace.v4.конфігурація.ФабрикаЕкземплярів;
import ua.od.atomspace.v4.модель.ВідповідьМитніці;
import ua.od.atomspace.v4.модель.Людина;
import ua.od.atomspace.v4.сервіс.*;

public class МитнийДодаток {
    public static void main(String[] args) {
        ФабрикаЕкземплярів фабрикаЕкземплярів = ФабрикаЕкземплярів.Одинак.взятиЕкзкмпляр();
        // зчитати людину
        ЧергаНаКордоні чергаНаКордоні = фабрикаЕкземплярів.взятиЕкземпляр(ЧергаНаКордоні.class);
        Людина людина = чергаНаКордоні.забратиКрайнього();

        // перевірити людину
        Митниця митниця = фабрикаЕкземплярів.взятиЕкземпляр(Митниця.class);
        ВідповідьМитніці відповідьМитніці = митниця.обробитиЛюдину(людина);

        //впустити до країни, або депортувати
        МіграційнаСлужба міграційнаСлужба = фабрикаЕкземплярів.взятиЕкземпляр(МіграційнаСлужба.class);
        міграційнаСлужба.мігрувати(відповідьМитніці);
    }
}
